test/Lagrangian/boundaries/system/Lagrangian/kinematicParticle/LagrangianSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/Lagrangian/kinematicParticle";
    object      LagrangianSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

tracking    linear;

ddtSchemes
{
    default     Euler;
}

SpSchemes
{
    default     none;
    Sp(D,U)     implicit;
}

averagingSchemes
{}

interpolationSchemes
{
    default     cell;
    Uc          cellPoint;
}

accumulationSchemes
{
    default     none;
    v           cellPoint;
    a           cellPoint;
}


// ************************************************************************* //
